app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."category" DESC
---
  def top
    @tasks = Task.all.order(category: :asc)

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def detail
    @task = Task.find_by(id: params[:id])

INSERT INTO "tasks" ("content", "created_at", "updated_at", "category") VALUES (?, ?, ?, ?)  [["content", "てすと"], ["created_at", "2020-04-30 13:53:10.190040"], ["updated_at", "2020-04-30 13:53:10.190040"], ["category", "てすと"]]
---
  def createToDo
    @task = Task.new(content: params[:content], category: params[:category])
    @task.save

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 14]]
---
  def delete
    @task = Task.find_by(id: params[:id])
    @task.destroy

SELECT "tasks".* FROM "tasks" WHERE "tasks"."category" = ? LIMIT ?  [["category", "A"], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 11]]
---
  def deleteCategory
    @task = Task.find_by(category: params[:category])
    @task.destroy

SELECT "tasks".* FROM "tasks" WHERE "tasks"."category" = ? LIMIT ?  [["category", "Ab"], ["LIMIT", 1]]
---
  def saveCategory
    @tasks = Task.find_by(category: "A")